app/Models/CharactersModel.php

    public function getCharacterById($id){
        $Character = $this->db->table('characters');
        $Character->where('id',$id);
        return $Character->get()->getResultArray();
---
SELECT *
FROM `characters`
WHERE `id` = ('53')